---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotCreateAnalyticalGeometry
source: html/d384e388-c378-980b-3557-bc59c6b73940.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.CannotCreateAnalyticalGeometry Property

Cannot construct Analytical Geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateAnalyticalGeometry { get; }
```